ehime_names = {
    38201: "松山市",
    38202: "今治市",
    38203: "宇和島市",
    38204: "八幡浜市",
    38205: "新居浜市",
    38206: "西条市",
    38207: "大洲市",
    38210: "伊予市",
    38213: "四国中央市",
    38214: "西予市",
    38215: "東温市",
    38356: "上島町",
    38386: "久万高原町",
    38401: "松前町",
    38402: "砥部町",
    38422: "内子町",
    38442: "伊方町",
    38484: "松野町",
    38488: "鬼北町",
    38506: "愛南町",
}

ehime_codes = {v.rstrip("県市町"): k for k, v in ehime_names.items()}

# 愛媛県は、東部の東予、中央部の中予、南西部の南予の3つの地域に分かれています
ehime_groups = {
    "東予": [38202, 38205, 38206, 38213, 38356],
    "中予": [38201, 38210, 38215, 38386, 38401, 38402],
    "南予": [38203, 38204, 38207, 38214, 38422, 38442, 38484, 38488, 38506],
}

def ehime_get_code(s):
    return ehime_codes.get(s.rstrip("県市町"), 0)

def ehime_get_name(n):
    return ehime_names.get(n, "")

def ehime_get_group(s):
    return ehime_groups.get(s, [])
